<template>
    <!-- Main modals -->
    <div v-if="isVisible" id="static-modal" tabindex="-1" aria-hidden="true"
        class="fixed inset-0 z-50 flex items-center justify-center bg-gray-900 bg-opacity-50">
        <div class="relative bg-white rounded-lg shadow  w-full max-w-4xl">
            <!-- Modal Header -->
            <div class="flex items-center justify-between p-4 md:p-5 border-b rounded-t">
                <h3 class="text-xl font-sarabun font-semibold text-gray-900 ">
                    ข้อกำหนดและการใช้งานเว็บไซต์</h3>
                <button @click="closeModal"  type="button"
                    class="text-gray-400 bg-transparent hover:bg-gray-200 hover:text-gray-900 rounded-lg text-sm w-8 h-8 inline-flex justify-center items-center">
                    <svg class="w-3 h-3" aria-hidden="true" xmlns="http://www.w3.org/2000/svg" fill="none"
                        viewBox="0 0 14 14">
                        <path stroke="currentColor" stroke-linecap="round" stroke-linejoin="round" stroke-width="2"
                            d="m1 1 6 6m0 0 6 6M7 7l6-6M7 7l-6 6" />
                    </svg>
                </button>
            </div>

            <!-- Modal Body -->
            <div class="p-4 md:p-5 space-y-4 max-h-[400px] overflow-y-auto">
                <div class="text-base font-sarabun leading-relaxed gap-2">
                    <strong>ข้อกำหนดและการใช้งานเว็บไซต์ของบริษัท ทศกัณฐ์ ดิจิตอล นิว เจนเนอเรชั่น
                        จำกัด</strong><br>
                        &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;ข้อกำหนดและเงื่อนไขการใช้งานเว็บไซต์ฉบับนี้ ซึ่งต่อไปในข้อกำหนดฉบับนี้จะเรียกว่า “ข้อกำหนด”
                    โดยมีรายละเอียดดังต่อไปนี้<br><br>

                    <strong>1) คำนิยาม</strong><br>
                    <div class="ml-4 space-y-2">
                        <p>1.1 “เว็บไซต์” หมายความว่า เว็บไซต์ของบริษัท ทศกัณฐ์ ดิจิตอล นิว เจนเนอเรชั่น จำกัด
                            และมีที่อยู่เว็บไซต์
                            https://partner.ddscservices.com/ &nbsp;
                            และอาจจะมีการเชื่อมต่อกับเว็บไซต์อื่นๆของเครือข่ายของบริษัทฯและเว็บไซต์อื่น
                            ๆ ของบุคคลภายนอก
                            ซึ่งดำเนินการและให้บริการซื้อขายสินค้าหรือบริการจัดการธุรกรรมซื้อขายผลิตภัณฑ์ต่างๆ
                            และให้หมายความรวมถึงเว็บไซต์อื่นๆ ของบริษัทฯ ที่จะมีขึ้นในอนาคตด้วย</p>
                        <p>1.2 “เจ้าของเว็บไซต์” หมายความว่า&nbsp;บริษัท ทศกัณฐ์ ดิจิตอล นิว เจนเนอเรชั่น
                            จำกัด&nbsp;ทะเบียนนิติบุคคลเลขที่ 0505567007065 สำนักงานตั้งอยู่ที่ 103 หมู่ 4
                            ถนนรอบเมืองเชียงใหม่ ตำบลสุเทพ จังหวัดเชียงใหม่ 50200</p>
                        <p>1.3 “ผู้ใช้งาน” หมายความว่า ผู้เยี่ยมชม ผู้ใช้ สมาชิกของเว็บไซต์
                            หรือบุคคลอื่นใดที่เข้าถึงเว็บไซต์ ไม่ว่าการเยี่ยมชม การใช้ การเป็นสมาชิก
                            หรือการเข้าถึงการกระทำด้วยวิธีใด ลักษณะใด ผ่านอุปกรณ์ใด ผ่านช่องทางใด
                            และไม่ว่าจะมีค่าใช้จ่ายหรือไม่ก็ตาม</p>
                        <p>1.4 “ข้อมูลส่วนบุคคล” หมายความว่า
                            ข้อมูลเกี่ยวกับบุคคลซึ่งทำให้สามารถระบุตัวบุคคลนั้นได้ไม่ว่าทางตรง ทางอ้อม
                            รวมถึงข้อมูลส่วนบุคคลตามกฎหมายเกี่ยวกับการคุ้มครองข้อมูลส่วนบุคคล</p>
                        <p>1.5 “เนื้อหา” หมายความว่า ข้อความ บทความ ความคิดเห็น บทวิเคราะห์ รูปภาพ สัญลักษณ์
                            เครื่องหมาย รูปภาพ ประดิษฐ์ ภาพถ่าย ภาพเคลื่อนไหว ภาพยนต์ เสียง สิ่งบันทึกเสียง
                            การออกแบบ คำสั่ง ชุดคำสั่ง หรือการสื่อสารไม่ว่าลักษณะใดและวิธีใด ๆ
                            ในเว็บไซต์และไม่ว่าเนื้อหานั้นจะมีการจำกัดการเข้าถึงหรือไม่ก็ตาม</p>
                    </div><br>

                    <strong>2) การเชื่อมโยงกับเว็บไซต์อื่นๆ</strong>
                    <div class="ml-4 space-y-2">
                        <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;เว็บไซต์อาจมีการเชื่อมต่อกับเว็บไซต์อื่น ๆ
                            เพื่อช่วยให้ผู้ใช้งานค้นหาเว็บไซต์
                            บริการ
                            และ/หรือ ผลิตภัณฑ์ที่เกี่ยวข้องได้อย่างรวดเร็วและง่ายดาย
                            เจ้าของเว็บไซต์ไม่สามารถที่จะควบคุม รับรอง
                            ยืนยันความถูกต้องหรือความน่าเชื่อถือหรือรับผิดชอบในเนื้อหาของเว็บไซต์ของบุคคลภายนอก
                            หรือการเชื่อมต่อใด ๆ ที่บรรจุอยู่ในเว็บไซต์ของบุคคลภายนอกได้</p>
                        <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;การตัดสินใจว่าบริการ
                            และ/หรือผลิตภัณฑ์ที่นำเสนอผ่านเว็บไซต์เหล่านี้สอดคล้องกับวัตถุประสงค์ของผู้ใช้งานหรือไม่นั้น
                            เป็นความรับผิดชอบของผู้ใช้งานเอง
                            เจ้าของเว็บไซต์ไม่สามารถควบคุมและจะไม่รับผิดชอบเนื้อหาของเว็บไซต์เหล่านั้นใด ๆ ทั้งสิ้น
                            และเจ้าของเว็บไซต์ไม่ได้มีส่วนเกี่ยวข้องในการกำหนดถึงการรับประกันใด ๆ
                            หรือต้องรับภาระค่าเสียหายที่เกี่ยวพันกับผู้ใช้งานหรือผู้ดำเนินงานของเว็บไซต์ใด ๆ
                            (รวมทั้งความเสียหายที่เกิดจากข้ออ้างใด ๆ
                            ก็ตามที่ละเมิดลิขสิทธิ์หรือทรัพย์สินทางปัญญาประเภทอื่นของเว็บไซต์ของบุคคลที่สามนั้น)</p>
                    </div><br>

                    <strong>3) การอนุญาตให้ใช้งานเว็บไซต์</strong>
                    <div class="ml-4 space-y-2">
                        <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;เจ้าของเว็บไซต์ได้เปิดใช้งานเว็บไซต์ตามข้อกำหนดฉบับนี้
                            และผู้ใช้งานมีความประสงค์จะใช้งานเว็บไซต์ดังกล่าว โดยในการใช้งานเว็บไซต์
                            ผู้ใช้งานได้อ่านและเข้าใจข้อความและเงื่อนไขต่างๆแห่งข้อกำหนดฉบับนี้โดยละเอียดดีแล้ว
                            และตกลงตามเงื่อนไขที่กำหนดไว้ในข้อความฉบับนี้แล้วทั้งสิ้น
                            ในการนี้เจ้าของเว็บไซต์จึงอนุญาตให้ผู้ใช้งาน
                            ใช้งานเว็บไซต์ภายใต้เงื่อนไขแห่งข้อกำหนดฉบับนี้</p>
                    </div><br>

                    <strong>4) ข้อห้ามการใช้งานเว็บไซต์</strong>
                    <p class="ml-4 space-y-2">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;ไม่ว่ากรณีใดๆในการใช้งานเว็บไซต์ของผู้ใช้งาน
                        ผู้ใช้งานตกลงจะไม่ใช้เว็บไซต์ไม่ว่าทางตรงหรือทางอ้อม
                        ไปในลักษณะใดลักษณะหนึ่ง ดังต่อไปนี้</p>
                    <div class="ml-8 space-y-2">
                        <p>4.1 กระทำการใดๆ ที่ขัดต่อกฎหมาย คำพิพากษาศาล หรือคำสั่งของรัฐบาล หรือหน่วยงานที่ใช้อำนาจรัฐ
                        </p>
                        <p>4.2 กระทำการใดๆ ที่อาจขัดต่อศีลธรรมอันดี ความสงบเรียบร้อย หรือจารีตประเพณี</p>
                        <p>4.3 กระทำการใดๆ อันเป็นการละเมิดทรัพย์สินทางปัญญา ลิขสิทธิ์ สิทธิบัตร สิทธิในชื่อเสียง
                            สิทธิส่วนบุคคล
                            หรือสิทธิอื่นใดของเจ้าของเว็บไซต์ หรือบุคคลอื่น</p>
                        <p>4.4 กระทำการใดๆ ที่นำไปสู่การเก็บรวบรวม การเปิดเผยหรือการใช้ซึ่งข้อมูลส่วนบุคคล
                            โดยไม่ชอบด้วยกฎหมาย</p>
                        <p>4.5 กระทำการใดๆ ที่รบกวนการทำงานของระบบแม่ข่าย ชุดคำสั่ง หรือระบบเครือข่ายของเว็บไซต์</p>
                        <p>4.6 กระทำการใดๆ อันเป็นการนำลิงค์จากภายนอกเข้าสู่เว็บไซต์โดยไม่ได้รับอนุญาตจากเจ้าของเว็บไซต์
                        </p>
                    </div><br>

                    <strong>5) บัญชีผู้ใช้</strong>
                    <div class="ml-4 space-y-2">
                        <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;ในการใช้งานเว็บไซต์
                            เจ้าของเว็บไซต์อาจจัดให้มีบัญชีผู้ใช้ของแต่ละผู้ใช้
                            ตามที่ผู้ใช้งานร้องขอในแต่ละคราว โดยที่เจ้าของเว็บไซต์มีสิทธิ์แต่เพียงผู้เดียว
                            ในการอนุมัติเปิดบัญชีผู้ใช้
                            กำหนดสิทธิ์การเข้าถึงข้อมูลของแต่ละประเภทบัญชีผู้ใช้ ค่าใช้จ่ายใดๆ เกี่ยวกับบัญชีผู้ใช้
                            หน้าที่
                            ความลับผิดชอบของผู้ใช้งานซึ่งเป็นเจ้าของบัญชีผู้ใช้นั้นๆ</p>
                        <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;ทั้งนี้ ผู้ใช้งานตกลงจะเก็บรักษาชื่อบัญชีผู้ใช้ รหัสผ่าน
                            และข้อมูลใดๆ
                            ของตนไว้เป็นความลับอย่างเคร่งครัด และตกลงจะไม่ยินยอมให้
                            รวมถึงตกลงจะใช้ความพยายามอย่างที่สุดในการป้องกันไม่ให้บุคคลอื่นใช้งานบัญชีของผู้ใช้งาน</p>
                        <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;ในกรณีที่มีการใช้บัญชีของผู้ใช้งานโดยบุคคลอื่น
                            ผู้ใช้งานตกลงและรับรองว่าการใช้งานโดยบุคคลอื่นดังกล่าว
                            ได้กระทำในฐานะตัวแทนของผู้ใช้งานและมีผลผูกพันเสมือนผู้ใช้งานเป็นผู้กระทำการเองทั้งสิ้น</p>
                    </div><br>

                    <strong>6) การเก็บและใช้ข้อมูลส่วนบุคคลของผู้ใช้งาน</strong>
                    <p class="ml-4 space-y-2">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;ในการใช้งานเว็บไซต์ ผู้ใช้งานรับทราบและตกลงให้ เจ้าของเว็บไซต์มีสิทธิ์จัดเก็บ
                        ประมวลผล
                        นำไปใช้ประโยชน์ซึ่งข้อมูลส่วนบุคคลของผู้ใช้งานที่ผู้ใช้งานให้ไว้แก่เจ้าของเว็บไซต์ อันได้แก่
                        ข้อมูลส่วนบุคคล
                        ดังต่อไปนี้</p>
                    <div class="ml-8 space-y-2">
                        <p>6.1 ข้อมูลทั่วไป หมายความว่า ข้อมูลเกี่ยวกับบุคคลซึ่งทำให้สามารถระบุ
                            และบ่งบอกตัวบุคคลของเจ้าของข้อมูลส่วนบุคคลนั้นได้ ไม่ว่าทางตรงหรือทางอ้อม เช่น ชื่อบริษัท
                            ชื่อ-นามสกุล
                            วันเดือนปีเกิด อายุ ที่อยู่ เพศ หมายเลขโทรศัพท์ หมายเลขบัตรประชาชน เลขนิติบุคคล อีเมล์
                            ไลน์ไอดี
                            ชื่อในการใช้งานเฟซบุ๊ก (Facebook) รูปถ่าย เป็นต้น</p>
                        <p>6.2 ข้อมูลด้านการทำธุรกิจ หมายความว่า ข้อมูลหรือสิ่งใด ๆ ที่แสดงออกมาในรูปแบบเอกสาร แฟ้ม
                            รายงาน หนังสือ แผนผัง
                            แผนที่ ภาพวาด ภาพถ่าย ฟิล์ม การบันทึกภาพนิ่ง
                            การบันทึกภาพเคลื่อนไหวหรือเสียงการบันทึกโดยเครื่องมือทางอิเล็กทรอนิกส์หรือวิธีอื่นใดที่ทำให้สิ่งที่บันทึกไว้ปรากฏขึ้นในเรื่องที่เกี่ยวกับการดำเนินธุรกิจของบุคคลที่สามารถระบุตัวบุคคลได้
                            และ/หรือ</p>
                        <p>6.3 ข้อมูลส่วนบุคคลที่มีความอ่อนไหว อันได้แก่ ข้อมูลชีวภาพ ข้อมูลสุขภาพ ประวัติอาชญากรรม
                            และข้อมูลที่แสดงอยู่ในเอกสารประจำตัว เป็นต้น โดยเป็นข้อมูลส่วนบุคคลที่มีความสมบูรณ์ ถูกต้อง
                            เป็นปัจจุบัน
                            และมีคุณภาพ จะถูกนำไปใช้ให้เป็นไปตามวัตถุประสงค์ที่กำหนดไว้ตามหนังสือนี้เท่านั้น
                            และบริษัทจะดำเนินมาตรการที่เข้มงวดในการรักษาความมั่นคงปลอดภัยตลอดจนการป้องกันมิให้มีการนำข้อมูลส่วนบุคคลไปใช้โดยมิได้รับอนุญาตจากเจ้าของข้อมูลส่วนบุคคลก่อน&nbsp;
                        </p>
                        <p>โดยข้อมูลส่วนบุคคลของผู้ใช้งานจะถูกนำไปใช้ในวัตถุประสงค์ ดังต่อไปนี้</p>
                        <p class="ml-4 space-y-2">6.1 เพื่อวัตถุประสงค์ในการขายสินค้า ให้บริการ วิเคราะห์ข้อมูล
                            ปรับปรุงคุณภาพสินค้าหรือการให้บริการ
                        </p>
                        <p class="ml-4 space-y-2">6.2 เพื่อประโยชน์ในการดำเนินงานของบริษัท เช่น การจัดซื้อจัดจ้าง การทำสัญญา
                            การทำธุรกรรมทางการเงิน
                            การดำเนินกิจกรรมบริษัท การติดต่อประสานงาน การโฆษณา ประชาสัมพันธ์ หรือให้ข้อมูลข่าวสารต่าง ๆ
                        </p>
                        <p class="ml-4 space-y-2">6.3 เพื่อปรับปรุงคุณภาพการทำงานให้มีประสิทธิภาพมากยิ่งขึ้น เช่น
                            การจัดทำฐานข้อมูล วิเคราะห์
                            และพัฒนากระบวนการดำเนินงานของบริษัท</p>
                        <p class="ml-4 space-y-2">6.4 เพื่อตรวจสอบรายการธุรกรรมที่อาจบ่งชี้ถึงการทุจริต</p>
                        <p class="ml-4 space-y-2">6.5 เพื่อประโยชน์ในการยืนยันหรือระบุตัวตนของเจ้าของข้อมูลส่วนบุคคล</p>
                        <p class="ml-4 space-y-2">6.6
                            เพื่อวัตถุประสงค์อื่นใดที่เกี่ยวข้องกับการขายสินค้าหรือให้บริการระหว่างท่านกับบริษัท</p>
                        <p class="ml-4 space-y-2">6.7
                            เพื่อปฏิบัติตามกฎหมายหรือกฎระเบียบของหน่วยงานราชการที่เกี่ยวข้องต่อการดำเนินงานของบริษัท
                            โดยบริษัทจะจัดเก็บ
                            และใช้ข้อมูลดังกล่าวตามระยะเวลาเท่าที่จำเป็นตามวัตถุประสงค์ที่ได้แจ้งเจ้าของข้อมูลส่วนบุคคลหรือตามที่กฎหมายกำหนดไว้หรือตามความจำเป็นทางเทคนิคเท่านั้น
                        </p>
                        <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;ในกรณีที่เจ้าของเว็บไซต์นำข้อมูลส่วนบุคคลของผู้ใช้งานออกใช้ประโยชน์
                            เจ้าของเว็บไซต์ตกลงจะใช้ข้อมูลดังกล่าว ตราบเท่าที่ไม่ก่อให้เกิดความเสียหาย
                            ความเดือดร้อนและความรำคาญแก่เจ้าของข้อมูล
                            และจะไม่เปิดเผยข้อมูลดังกล่าวต่อบุคคลภายนอกในลักษณะที่อาจระบุตัวตนของผู้ใช้งานเจ้าของข้อมูลได้
                            เว้นแต่เป็นการใช้และเปิดเผยตามที่กฎหมายกำหนดหรือโดยคำสั่งของหน่วยงานที่บังคับใช้อำนาจรัฐ</p>
                    </div><br>

                    <strong>7) คำรับรองและหน้าที่ของผู้ใช้งาน</strong>
                    <p class="ml-4 space-y-2">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;ในการใช้งานเว็บไซต์ของผู้ใช้งาน
                        ผู้ใช้งานมีหน้าที่และให้คำรับรองต่อเจ้าของเว็บไซต์
                        ว่าจะใช้ความพยายามอย่างที่สุดเพื่อปฏิบัติตามหน้าที่ของผู้ใช้งานและตลอดจนเงื่อนไขของข้อกำหนด
                        ดังต่อไปนี้</p>
                    <div class="ml-8 space-y-2">
                        <p>7.1 ผู้ใช้งานได้อ่านและเข้าใจข้อความและเงื่อนไขต่างๆ แห่งข้อกำหนดฉบับนี้โดยละเอียดตลอดดีแล้ว
                            และในการเข้าเยี่ยมชม ใช้งาน หรือการเป็นสมาชิกของเว็บไซต์
                            ผู้ใช้งานตกลงตามเงื่อนไขที่กำหนดไว้ในข้อกำหนดฉบับนี้แล้วทั้งสิ้น</p>
                        <p>7.2 ผู้ใช้งานเข้าใจและรับทราบดีว่าข้อกำหนดฉบับนี้
                            เป็นสัญญาฉบับหนึ่งซึ่งมีผลผูกพันและสามารถบังคับใช้ได้ตามกฎหมายระหว่างเจ้าของเว็บไซต์และผู้ใช้งาน
                        </p>
                        <p>7.3 ผู้ใช้งานจะดำเนินการใด ๆ อันจำเป็นและสมควรให้พนักงานของผู้ใช้งาน ผู้รับจ้างช่วง ผู้ช่วย
                            ที่ปรึกษาหรือตัวแทนใด ๆ ของผู้ใช้งาน(ถ้ามี) ปฎิบัติตามข้อกำหนดฉบับนี้โดยเคร่งครัดด้วย</p>
                        <p>7.4 ในกรณีที่มีบุคคลอื่นใช้สิทธิเรียกร้องหรือมีข้อเรียกร้องต่อผู้ใช้งาน
                            หรือผู้ใช้งานถูกฟ้องร้องดำเนินคดีเกี่ยวกับหรือมีสาเหตุมาจากการใช้งานเว็บไซต์ของผู้ใช้งาน
                            ผู้ใช้งานจะยุติข้อเรียกร้องด้วยค่าใช้จ่ายและความรับผิดชอบของผู้ใช้งานเอง
                            และผู้ใช้งานตกลงจะปกป้องด้วยความพยายามอย่างที่สุดไม่ให้เจ้าของเว็บไซต์เข้าไปเกี่ยวข้องในกระบวนการยุติข้อเรียกร้องดังกล่าว
                        </p>
                        <p>7.5
                            ในกรณีที่เจ้าของเว็บไซต์มีค่าเสียหายหรือค่าใช้จ่ายเกี่ยวกับหรือมีสาเหตุมาจากการใช้งานเว็บไซต์ของผู้ใช้งาน
                            ผู้ใช้งานตกลงจะชดใช้ค่าเสียหายหรือค่าใช้จ่ายดังกล่าวให้แก่เจ้าของเว็บไซต์โดยสิ้นเชิง</p>
                    </div><br>

                    <strong>8) เนื้อหาของผู้ใช้งาน</strong>
                    <p class="ml-4 space-y-2">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;ในการใช้งานเว็บไซต์
                        ผู้ใช้งานอาจสามารถแสดงเนื้อหาของผู้ใช้งานภายในเว็บไซต์ได้
                        ไม่ว่ามีการจำกัดสิทธิ์การเข้าถึงเนื้อหาหรือไม่ก็ตาม
                        โดยผู้ใช้งานตกลงจะ</p>
                    <div class="ml-8 space-y-2">
                        <p>8.1 ไม่แสดงเนื้อหาที่เป็นการละเมิดสิทธิของบุคคลอื่น ซึ่งรวมถึงแต่ไม่จำกัดเฉพาะลิขสิทธิ์
                            กรรมสิทธิ์ สิทธิบัตร
                            สิทธิในเครื่องหมายการค้า สิทธิในแบบผลิตภัณฑ์ สิทธิในผลิตภัณฑ์อรรถประโยชน์ ความลับทางการค้า
                            สิทธิในเกียรติยศชื่อเสียง สิทธิในภาพบุคคล สิทธิส่วนบุคคล และสิทธิในชื่อเสียง</p>
                        <p>8.2 ไม่แสดงเนื้อหาที่ขัดต่อความสงบเรียบร้อยและศีลธรรมอันดีของประชาชน การสนับสนุนความรุนแรง
                            และการกระทำผิดกฎหมาย
                        </p>
                        <p>8.3 ไม่แสดงเนื้อหาใดๆ ที่น่าสงสัย หยายคาย หลอกลวง
                            ล่อลวงหรือชี้แนะในลักษณะที่อาจเป็นอันตรายต่อผู้ใช้งานรายอื่น
                            หรืออาจก่อให้เกิดการกระทำผิดกฎหมาย</p>
                        <p>8.4 ไม่แสดงข้อมูลส่วนตัวหรือข้อมูลความลับที่เป็นของผู้อื่นโดยไม่ได้รับอนุญาตจากเจ้าของข้อมูล
                        </p>
                        <p>8.5 ไม่แสดงเนื้อหาที่เป็นเท็จ
                            ไม่ว่าเป็นการแสดงเนื้อหาอันเป็นเท็จนั้นจะก่อให้เกิดความเสียหายต่อผู้อื่นหรือไม่ก็ตาม</p>
                        <p>8.6 ไม่แสดงเนื้อหาที่นำไปสู่การเลือกปฎิบัติทางเชื้อชาติ ชาติกำเหนิด สัญชาติ ศาสนา เพศ
                            สถานภาพทางสังคม ฯลฯ</p>
                    </div><br>

                    <strong>9) การปฏิบัติผิดข้อกำหนดของผู้ใช้งาน</strong>
                    <p class="ml-4">ในกรณีดังต่อไปนี้</p>
                    <div class="ml-8 space-y-2">
                        <p>9.1 ผู้ใช้งานฝ่าฝืนข้อกำหนดฉบับนี้
                            คำรับรองของผู้ใช้งานที่ให้ไว้ในข้อกำหนดฉบับนี้หรือแนวทางปฎิบัติใดๆ
                            ที่เจ้าของเว็บไซต์ได้แจ้งให้ผู้ใช้งานทราบไม่ว่าโดยทั่วไปหรือเฉพาะเจาะจง</p>
                        <p>9.2 ผู้ใช้งานใช้งานเว็บไซต์ไปในวัตถุประสงค์ที่ผิดกฎหมาย ขัดต่อความสงบเรียบร้อยของสังคม</p>
                        <p>9.3 ผู้ใช้งานกระทำการใดๆ ที่อาจก่อให้เกิดความเสียหายแก่เว็บไซต์ เจ้าของเว็บไซต์
                            ผู้ใช้งานรายอื่นหรือบุคคลภายนอ
                        </p>
                        <p>9.4 ผู้ใช้งานกระทำการใดๆ ที่เจ้าของเว็บไซต์พิจารณาเห็นว่าไม่เหมาะสม
                            เจ้าของเว็บไซต์โดยดุลพินิจของเจ้าของเว็บไซต์แต่เพียงผู้เดียว อาจดำเนินการดังต่อไปนี้</p>
                        <p class="ml-4">(9.4.1) ส่งหนังสือเตือนอย่างเป็นทางการให้ผู้ใช้งานแก้ไขหรือยุติพฤติกรรมดังกล่าว
                        </p>
                        <p class="ml-4">(9.4.2) ระงับการใช้เว็บไซต์ของผู้ใช้งานภายในระยะเวลาใดระยะเวลาหนึ่ง
                            โดยจะมีกำหนดระยะเวลาหรือไม่ก็ได้โดยไม่ต้องแจ้งให้ทราบล่วงหน้า และ</p>
                        <p class="ml-4">(9.4.3)
                            ยกเลิกสิทธิ์การใช้หรือการเข้าถึงเว็บไซต์ของผู้ใช้งานโดยไม่ต้องแจ้งให้ทราบล่วงหน้า
                            ในกรณีที่เจ้าของเว็บไซต์ระงับการใช้งานหรือยกเลิกสิทธิ์การใช้หรือการเข้าถึงเว็บไซต์ตามข้อกำหนดฉบับนี้
                            ผู้ใช้งานรับทราบและตกลงว่า เจ้าของเว็บไซต์ไม่มีความรับผิดชอบสำหรับความสูญเสีย ความเสียหาย
                            ข้อเรียกร้อง
                            ความรับผิด ค่าใช้จ่ายใดๆ ที่เกิดจากหรือเกี่ยวข้องกับการดำเนินการดังกล่าวตามข้อกำหนดฉบับนี้
                        </p>
                    </div><br>

                    <strong>10) ความพร้อมใช้งานของเว็บไซต์</strong>
                    <p class="ml-4 space-y-2">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;ผู้ใช้งานตกลงและทราบดีว่า
                        เจ้าของเว็บไซต์อาจระงับการใช้งานเว็บไซต์ไม่ว่าทั้งหมดหรือแต่บางส่วน
                        ไม่ว่าเป็นการชั่วคราวหรือถาวร
                        โดยไม่มีหน้าที่ต้องชดเชยความเสียหายใดๆ ที่อาจเกิดขึ้นแก่ผู้ใช้งาน ดังกรณีดังต่อไปนี้</p>
                    <div class="ml-8 space-y-2">
                        <p>10.1 การบำรุงรักษาเครื่องมือ และอุปกรณ์ที่จำเป็นในการเปิดให้ใช้งานเว็บไซต์
                            อันรวมถึงแต่ไม่จำกัดเพียงการบำรุงรักษาระบบแม่ข่าย (Server Maintenance)</p>
                        <p>10.2 การปรับปรุงและพัฒนาระบบชุดคำสั่งที่เกี่ยวข้องกับการเปิดให้ใช้งานเว็บไซต์
                            อันรวมถึงแต่ไม่จำกัดเพียงการปรับปรุงชุดคำสั่งของเว็บไซต์ (Update)
                            การปรับปรุงชุดคำสั่งของระบบ (Firmware update)
                        </p>
                        <p>10.3 เครื่องมือ อุปกรณ์ หรือระบบชุดคำสั่งที่เกี่ยวข้องกับการเปิดให้ใช้งานเว็บไซต์
                            ไม่สามารถใช้งานได้อันเนื่องมาจากเครื่องมือ อุปกรณ์ หรือระบบชุดคำสั่งนั้น ไม่ว่าเครื่องมือ
                            อุปกรณ์
                            หรือระบบชุดคำสั่งนั้นจะอยู่ในความครอบครองของเจ้าของเว็บไซต์หรือบุคคลภายนอกก็ตาม</p>
                        <p>10.4 เหตุสุดวิสัย อันรวมถึงแต่ไม่จำกัดเพียง ระบบไฟฟ้าขัดข้อง ระบบติดต่อสื่อสารขัดข้อง
                            อุบัติเหตุ อุบัติภัย
                            เพลิงไหม้ ภัยธรรมชาติ การนัดหยุดงาน การบังคับใช้หรือเปลี่ยนแปลงกฎหมาย คำสั่งของรัฐบาล</p>
                    </div><br>

                    <strong>11) ความยกเว้นความรับผิด</strong>
                    <p class="ml-4 space-y-2">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;ผู้ใช้งานตกลงและทราบดีว่า
                        ไม่มีส่วนหนึ่งส่วนใดในข้อกำหนดฉบับนี้หรือภายในเว็บไซต์ไม่ว่าโดยชัดแจ้งหรือโดยปริยายที่เจ้าของเว็บไซต์จะ
                    </p>
                    <div class="ml-8 space-y-2">
                        <p>11.1 รับประกันความเสถียร ความเชื่อถือได้ ความแม่นยำ ความสมบูรณ์ ประสิทธิผล
                            ความเหมาะสมกับวัตถุประสงค์โดยเฉพาะเจาะจงของผู้ใช้งาน ความปลอดภัย และข้อผิดพลาดของเว็บไซต์
                        </p>
                        <p>11.2 รับผิดชอบค่าเสียหายใดๆ ที่เกิดขึ้นกับผู้ใช้งานในการใช้เว็บไซต์
                            อันรวมถึงแต่ไม่จำกัดเพียงความเสียหายต่ออุปกรณ์
                            ระบบที่ผู้ใช้งานใช้ในการใช้งานเว็บไซต์หรือการสูญหายของข้อมูลหรือเนื้อหาของผู้ใช้งาน
                            สิทธิและชื่อเสียงของผู้ใช้งาน ยกเว้น
                            ความเสียหายดังกล่าวเกิดจากการกระทำโดยเจตนาหรือประมาทเลินเล่ออย่างร้ายแรงของเจ้าของเว็บไซต์
                        </p>
                        <p>11.3 รับผิดชอบค่าเสียหายใดๆ ที่เกิดขึ้นจากการกระทำของบุคคลภายนอก อันรวมถึงแต่ไม่จำกัดเพียง
                            การกระทำของผู้ไม่ได้รับอนุญาตให้เข้าถึงข้อมูล (Hacker) อาชญากรคอมพิวเตอร์</p>
                    </div><br>

                    <strong>12) ทรัพย์สินทางปัญญา</strong>
                    <div class="ml-4 space-y-2">
                        <p>
                            &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;ผู้ใช้งานเข้าใจและรับทราบดีว่าสิทธิ์ในทรัพย์สินทางปัญญาทั้งปวงอันรวมถึงแต่ไม่จำกัดเพียง
                            เนื้อหาของเจ้าของเว็บไซต์ ลิขสิทธิ์ สิทธิบัตร เครื่องหมายการค้า เครื่องหมายบริการ
                            ชื่อทางการค้าหรือการออกแบบ
                            ระบบงานใดที่ปรากฎในเว็บไซต์และที่ใช้งานบนเว็บไซต์ ไม่ว่าระยะเวลาใด
                            เป็นสิทธิเด็ดขาดของเจ้าของเว็บไซต์ทั้งสิ้น
                        </p>
                        <p>
                            &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;ผู้ใช้งานมีสิทธิใช้ซึ่งทรัพย์สินทางปัญญาอย่างเพิกถอนได้และอย่างไม่สามารถโอนแก่กันได้
                            ตราบเท่าที่เจ้าของเว็บไซต์อนุญาตให้ใช้ ภายใต้เงื่อนไขแห่งข้อกำหนดฉบับนี้เท่านั้นและไม่ว่า ณ
                            เวลาใดๆ
                            ไม่มีข้อตกลงใดในข้อกำหนดฉบับนี้ ไม่ว่าโดยชัดแจ้งหรือโดยปริยาย ที่เป็นการโอนสิทธิใดๆ
                            อันเกี่ยวกับทรัพย์สินทางปัญญาดังกล่าวให้แก่ผู้ใช้งานทั้งทางตรงและทางอ้อม</p>
                    </div><br>

                    <strong>13) การเก็บรักษาความลับ</strong>
                    <p class="ml-4 space-y-2">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;ในการใช้งานเว็บไซต์ ผู้ใช้งานอาจได้ล่วงรู้
                        หรือได้รับข้อมูลจากเจ้าของเว็บไซต์ หรือจากบุคคลอื่นใดเพื่อการใช้งานเว็บไซต์ตามข้อกำหนดฉบับนี้
                        ซึ่งยังไม่ได้มีการเปิดเผยอย่างสาธารณะหรือไม่มีเจตนาให้ถูกเปิดเผยอย่างทั่วไป ณ
                        ขณะที่เปิดเผยข้อมูล
                        ผู้ใช้งานตกลงจะรักษาข้อมูลของเจ้าของเว็บไซต์หรือข้อมูลที่ได้รับจากเจ้าของเว็บไซต์ไว้เป็นความลับ
                        ไม่ว่าจะเป็นข้อมูลส่วนบุคคลหรือข้อมูลทางการค้า และไม่ว่าจะมีมูลค่าหรือไม่ก็ตาม และจะไม่เปิดเผย
                        ตีพิมพ์ประกาศหรือเผยแพร่ต่อบุคคลที่สาม เว้นแต่จะเป็นการกระทำตามกฎหมาย
                        คำสั่งของหน่วยงานที่บังคับใช้
                        อำนาจของรัฐหรือได้รับความยินยอมเป็นลายลักษณ์อักษรจากเจ้าของเว็บไซต์ก่อนล่วงหน้า</p>
                    <br>

                    <strong>14) การแก้ไขเปลี่ยนแปลง</strong>
                    <p class="ml-4">
                        &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;เจ้าของเว็บไซต์อาจแก้ไขและเปลี่ยนแปลงข้อความในข้อกำหนดฉบับนี้ได้
                        ไม่ว่าเวลาใดก็ตาม และไม่ว่าทั้งหมดหรือบางส่วน
                        เจ้าของเว็บไซต์แนะนำให้ผู้ใช้งานหมั่นตรวจสอบการเปลี่ยนแปลงข้อกำหนดในแต่ละคราว
                        และให้ถือว่าข้อตกลงที่แก้ไขเพิ่มเติมดังกล่าวเป็นส่วนหนึ่งของข้อกำหนดฉบับนี้ด้วย</p>
                    <br>

                    <strong>15) กฎหมายที่ใช้บังคับ</strong>
                    <p class="ml-4">ข้อกำหนดฉบับนี้อยู่ภายใต้บังคับกฎหมายของประเทศไทย</p>
                    <br>

                    <strong>16) การระงับข้อพิพาท</strong>
                    <p class="ml-4">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;หากมีข้อโต้แย้ง ข้อขัดแย้งใดๆ
                        เกิดขึ้นอันเนื่องมาจากข้อกำหนดฉบับนี้
                        หากคู่สัญญาไม่สามารถตกลงกันได้ คู่สัญญาตกลงจะนำข้อพิพาทดังกล่าวขึ้นฟ้องต่อศาลในประเทศไทย</p>
                </div>
            </div>

            <!-- Modal Footer -->
            <div
                class="flex flex-col justify-center p-4 md:p-5 border-t border-gray-200 rounded-b ">
                <span class="font-sarabun">ยินยอมเมื่อ xx/xx/xxxx xx:xx:xx </span>
                <div class="flex justify-center items-center w-full">
                    <button @click="closeModal" type="button"
                        class="text-white font-sarabun bg-red-500 hover:bg-red-700 font-medium rounded-lg text-sm px-5 py-2.5 text-center">
                        ปิด
                    </button>
                </div>
            </div>
        </div>
    </div>
    <!-- End Main modals -->
</template>

<script>
export default {
    props: {
    isVisible: Boolean,
    contractDetails: String
  },
  methods: {
    closeModal() {
      this.$emit('close'); // Emit close event to parent
    }
  }
}
</script>

<style></style>