<template>
    <!-- Main modals -->
    <div v-if="isVisible" id="static-modal" tabindex="-1" aria-hidden="true"
        class="fixed inset-0 z-50 flex items-center justify-center bg-gray-900 bg-opacity-50">
        <div class="relative bg-white rounded-lg shadow  w-full max-w-4xl">
            <!-- Modal Header -->
            <div class="flex items-center justify-between p-4 md:p-5 border-b rounded-t">
                <h3 class="text-xl font-sarabun font-semibold text-gray-900 ">
                    เปิด E-Market</h3>
                <button @click="closeModal" type="button"
                    class="text-gray-400 bg-transparent hover:bg-gray-200 hover:text-gray-900 rounded-lg text-sm w-8 h-8 inline-flex justify-center items-center">
                    <svg class="w-3 h-3" aria-hidden="true" xmlns="http://www.w3.org/2000/svg" fill="none"
                        viewBox="0 0 14 14">
                        <path stroke="currentColor" stroke-linecap="round" stroke-linejoin="round" stroke-width="2"
                            d="m1 1 6 6m0 0 6 6M7 7l6-6M7 7l-6 6" />
                    </svg>
                </button>
            </div>

            <!-- Modal Body -->
            <div class="p-4 md:p-5 space-y-4 max-h-[400px] overflow-y-auto">
                <div class="text-base font-sarabun leading-relaxed gap-2">
                    <strong>สัญญาคู่ค้าฝากขาย (E-Market)</strong>
                    <p class="ml-4">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;สัญญาฉบับนี้จัดทำขึ้น ณ บริษัท ทศกัณฐ์ ดิจิตอล นิว เจนเนอเรชั่น จำกัด เมื่อวันที่<u>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</u>ระหว่างบริษัท ทศกัณฐ์ ดิจิตอล นิว เจนเนอเรชั่น จำกัด สำนักงานตั้งอยู่เลขที่ 103 หมู่ 4 ถนนรอบเมืองเชียงใหม่ ตำบลสุเทพ อำเภอเมืองเชียงใหม่ จังหวัดเชียงใหม่ 50200 เลขประจำตัวผู้เสียภาษี 0505567007065 ซึ่งต่อไปในสัญญาฉบับนี้ เรียกว่า “บริษัทฯ” ฝ่ายหนึ่ง</p>
                    <br>

                    <p class="ml-4">กับ นาย/นาง/นางสาว<u>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</u>ซึ่งต่อไปนี้เรียกว่า “ผู้ฝากขาย”อีกฝ่ายหนึ่ง</p>
                    <br>

                    <p class="ml-4">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;โดยบริษัท ทศกัณฐ์ ดิจิตอล นิว เจนเนอเรชั่น จำกัด เป็นบริษัทฯ ที่ดำเนินการเป็นตัวกลางในการซื้อขายผลิตภัณฑ์ ในการให้บริการลูกค้าโดยตรงและผ่านเว็ปไซต์&nbsp;<a href="http://tossaguns.com/" rel="noopener noreferrer" target="_blank" class="text-blue-600">http://tossaguns.com</a>&nbsp;หรือทุกช่องทางของบริษัทฯ</p>
                    <br>

                    <p class="ml-4">ทั้งสองฝ่ายตกลงทำสัญญากันดังมีข้อความต่อไปนี้<strong>&nbsp;</strong></p>
                    <br>

                    <strong>1) คำจำกัดความ</strong>
                    <div class="ml-4 space-y-2">
                        <p>1.1 ลายมือชื่ออิเล็กทรอนิกส์ หมายถึง ว่าด้วย พระราชบัญญัติว่าด้วยธุรกรรมทางอิเล็กทรอนิกส์ พ.ศ. 2544&nbsp;ลายมือชื่ออิเล็กทรอนิกส์ หมายถึง อักษร อักขระ ตัวเลข เสียงหรือสัญลักษณ์อื่นใดที่สร้างขึ้นให้อยู่ในรูปแบบอิเล็กทรอนิกส์ซึ่งนำมาใช้ประกอบกับข้อมูลอิเล็กทรอนิกส์ เพื่อแสดงความสัมพันธ์ระหว่างบุคคลกับข้อมูลอิเล็กทรอนิกส์ โดยมีวัตถุประสงค์เพื่อระบุตัวบุคคลผู้เป็นเจ้าของลายมือชื่ออิเล็กทรอนิกส์ที่เกี่ยวข้องกับข้อมูลอิเล็กทรอนิกส์นั้นและเพื่อแสดงว่าบุคคลดังกล่าวยอมรับข้อความในข้อมูลอิเล็กทรอนิกส์นั้น</p>
                        <p>1.2 ผู้ฝากขาย หมายถึง ผู้จำหน่ายสินค้าหรือให้บริการรวมถึงการดำเนินการตามแผนการตลาดของบริษัทฯ ภายใต้ขอบเขตของบริษัทฯ</p>
                        <p>1.3 บริษัทฯ หมายถึง บริษัท ทศกัณฐ์ ดิจิตอล นิว เจนเนอเรชั่น จำกัด</p>
                        <p>1.4 ข้อมูลส่วนบุคคล หมายถึง ข้อมูลเกี่ยวกับบุคคลซึ่งทำให้สามารถระบุตัวบุคคลนั้นได้ไม่ว่าทางตรง ทางอ้อม รวมถึงข้อมูลส่วนบุคคลตามกฎหมายเกี่ยวกับการคุ้มครองข้อมูลส่วนบุคคล</p>
                        <p>1.5 ข้อมูลอันเป็นความลับ หมายถึง ข้อมูลส่วนบุคคล หรือข้อมูลทางการค้า ความลับเชิงพาณิชย์ ข้อมูลที่เป็นความลับหรือทางการค้าเกี่ยวกับบริษัทฯ และคู่สัญญาของบริษัทฯ</p>
                        <p>1.6 ทรัพย์สินทางปัญญา หมายถึง สิทธิในทรัพย์สินทางปัญญาทั้งปวงอันรวมถึงแต่ไม่จำกัดเพียง ลิขสิทธิ์ สิทธิบัตร เครื่องหมายทางการค้า เครื่องหมายบริการ ซึ่งทางการค้าหรือการออกแบบของระบบงานใดที่เกิดจากการสร้างสรรค์ คิดค้น ออกแบบ</p>
                        <p>1.7 เหตุสุดวิสัย หมายถึง เหตุใด ๆ ที่คู่สัญญาไม่อาจป้องกันหรือมิได้เกิดจากการกระทำของคู่สัญญานั้น แม้ว่าจะได้ใช้ความระมัดระวังอันตามสมควรอันพึงคาดหมายได้จากบุคคลในฐาน และภาวะเช่นนั้นซึ่งได้แก่ เหตุที่เกิดจากภัยธรรมชาติ เช่น น้ำท่วม ไฟไหม้ แผ่นดินไหวหรือเกิดจากการใช้อำนาจรัฐหรือการกระทำโดยบุคคลภายนอกหรือปัจจัยภายนอก</p>
                        <p>1.8 สินค้า หมายถึง สินค้าที่เจ้าของสินค้าทำการผลิตหรือนำเข้าหรือสินค้าประเภทอื่น ๆ ที่เกี่ยวข้องที่มี ณ ปัจจุบัน หรือจะมีเพิ่มเติมในอนาคตที่เจ้าของสินค้าฝากให้แก่บริษัทฯ เพื่อจำหน่ายให้แก่ลูกค้าหรือสินค้าที่ทางบริษัทฯ จัดหาหรือผลิตเอง</p>
                        <p>1.9<strong>&nbsp;</strong><a href="https://tossaguns.com/" rel="noopener noreferrer" target="_blank" class="text-blue-600">https://tossaguns.com</a>&nbsp;หมายถึง เว็บไซต์ของบริษัทฯ ในการซื้อขายสินค้าหรือบริการจัดการธุรกรรมซื้อขายผลิตภัณฑ์ต่างๆ และให้หมายความรวมถึงเว็บไซต์อื่นๆ ของบริษัทฯ ที่จะมีขึ้นในอนาคตด้วย</p>
                        <p>1.10 ทุกช่องทางของบริษัทฯ หมายถึง ช่องทางออนไลน์อื่นใดที่อยู่ภายใต้เว็บไซต์ของบริษัทฯ </p>
                        <p>1.11 ลูกค้า หมายถึง บุคคลธรรมดา ร้านค้าหรือนิติบุคคลทั่วไป ที่ซื้อสินค้าจากเจ้าของสินค้าในลักษณะซื้อ-ขายเสร็จเด็ดขาดบนหน้าเว็บไซต์&nbsp;<a href="https://tossaguns.com/" rel="noopener noreferrer" target="_blank" class="text-blue-600">https://tossaguns.com</a>&nbsp;หรือทุกช่องทางของบริษัทฯ</p>
                    </div><br>

                    <strong>2) มาตรฐานของสินค้า</strong>
                    <div class="ml-4 space-y-2">
                        <p>2.1 สินค้าของผู้ฝากขาย ต้องมีเอกสารหลักฐานยืนยันถูกต้องตามที่กฎหมายกำหนดตามสินค้าและผลิตภัณฑ์นั้น ๆ เช่น ใบอนุญาตจากสำนักงานคณะกรรมการอาหารและยา (อย.) การรับรองมาตรฐานผลิตภัณฑ์ชุมชน (มผช.) ใบอนุญาตมาตรฐานผลิตภัณฑ์อุตสาหกรรม (มอก.) หรือใบอนุญาตต่าง ๆ ที่ทางราชการออกให้ เพื่อใช้ขออนุญาตขายตรงและตลาดแบบตรง จึงจะสามารถนำมาขายในช่องทางการจำหน่ายของบริษัทฯ ได้ กรณีผู้ฝากขายให้ข้อมูลไม่ตรงตามความเป็นจริงให้ถือเป็นโมฆะมาตั้งแต่ต้น</p>
                        <p>2.2 ผู้ฝากขาย มีหน้าที่ให้รายละเอียดสินค้า รูปภาพ และคุณสมบัติของสินค้า และใบอนุญาตที่กฎหมายกำหนด และต้องผ่านการรับรองผลิตภัณฑ์จากสำนักงานคณะกรรมการอาหารและยา (Food and Drug Administration) กระทรวงสาธารณะสุข ตลอดจนการนำเสนอสินค้าต้องเป็นไปตามรูปแบบที่บริษัทฯ กำหนดเท่านั้น ด้วยค่าใช้จ่ายของผู้ฝากขายเองทั้งสิ้น และผู้ฝากขายต้องให้รายละเอียดข้อมูลกับบุคลากรของบริษัทฯ เพื่อให้มีความรู้ ความเข้าใจในตัวสินค้าที่จำหน่ายของเจ้าของสินค้า ด้วยค่าใช้จ่ายของผู้ฝากขายเองทั้งสิ้น</p>
                    </div><br>

                    <strong>3) การรับรองยืนยันจากผู้ส่งสินค้า</strong>
                    <div class="ml-4 space-y-2">
                        <p>3.1 บริษัทฯ ขอสงวนสิทธิ์ในการคัดเลือกสินค้าในการขึ้นขายในแอปพลิเคชัน&nbsp;และหากมีลูกค้าร้องเรียนหรือฟ้องร้องทางกฎหมายเกี่ยวกับสินค้าหรือการจัดส่ง ทางผู้ส่งสินค้าจะต้องรับผิดชอบทั้งหมด</p>
                        <p>3.2 ผู้ส่งสินค้าจะต้องรับประกันว่าสินค้า</p>
                        <div class="ml-4 space-y-2">
                            <p>3.2.1 เป็นสินค้าที่ปลอดภัย มีคุณภาพดีปราศจากข้อบกพร่องในการผลิต หีบห่อต้องได้มาตรฐาน และสะอาดถูกสุขลักษณะ</p>
                            <p>3.2.2 ไม่ใช่สินค้าที่มีอายุการจัดเก็บระยะสั้น /เน่าเสียง่าย /แตกหักง่าย</p>
                            <p>3.2.3 สินค้าประเภทเครื่องสำอาง อาหาร และอาหารเสริม ต้องมีการจดทะเบียนตามมาตรฐานการรับรองของสำนักงานคณะกรรมการอาหารและยาประเทศไทย และจะต้องมีใบอนุญาตให้โฆษณาได้ โดยเลขที่จดแจ้งจะต้องยังไม่หมดอายุ นอกจากนี้ต้องมีการขายสินค้าดังกล่าวในช่องทางอื่นมาแล้วไม่ต่ำกว่า 6 เดือน (ยกเว้นกรณีที่เป็นสินค้าแบรนด์เดียวกันแต่ออกสินค้าใหม่)</p>
                            <p>3.2.4 สำหรับสินค้าทุกชนิดที่ต้องมีการขึ้นทะเบียนกับหน่วยงานภาครัฐของประเทศไทย เช่น อย. หรือ มอก. เป็นต้น ผู้ส่งสินค้าต้องยื่นเอกสารจดทะเบียนเครื่องหมายการค้าประกอบการพิจารณาด้วย บริษัทฯ จึงสามารถยอมรับได้ หากเครื่องหมายทางการค้ายังอยู่ในระหว่างดำเนินการ ผู้ส่งสินค้าจะต้องรับผิดชอบต่อความเสียหายทั้งหมดแต่เพียงผู้เดียว ในกรณีที่มีการพิพาทหรือฟ้องร้องเกี่ยวกับสินค้า/เครื่องหมายทางการค้า/ลิขสิทธิ์/สินค้าปลอมแปลงหรือสินค้าที่ไม่ได้มาตรฐาน และยอมรับที่จะชดใช้ค่าเสียหายใด ๆ หากเกิดความเสียหายแก่ลูกค้า</p>
                            <p>3.2.5 สินค้าที่นำมาจำหน่ายจะต้องไม่ใช่รายการสินค้าต้องห้ามและสินค้าที่ถูกจำกัด อาทิเช่น ยารักษาโรค ยาเสพติด เป็นต้น</p>
                            <p>3.2.6 สินค้าที่นำมาจำหน่ายจะต้องไม่ใช่สินค้าลอกเลียนแบบ /ไม่ได้รับอนุญาต /ละเมิดเครื่องหมายการค้า /สิทธิบัตร /ลิขสิทธิ์หรือทรัพย์สินทางปัญญาของผู้อื่นหรือคณะบุคคลอื่นในทุกประเทศทั่วโลก (Trade Mark)</p>
                            <p>3.2.7 สินค้าที่นำมาจำหน่ายจะต้องไม่มีการโฆษณาชวนเชื่อเกินความจริง</p>
                            <p>3.2.8 สินค้าที่นำมาจำหน่ายจะต้องไม่ใช่สินค้าผิดกฎหมายหรือขัดต่อศีลธรรมอันดีของประชาชน</p>
                            <p>3.2.9 หากมีการละเมิดข้อตกลงที่ได้ระบุไว้ในสัญญาฉบับนี้ ทางบริษัทฯ มีสิทธิ์เด็ดขาดในการหยุดทำการขายโดยไม่ต้องแจ้งให้ผู้ส่งสินค้าทราบล่วงหน้า</p>
                        </div>
                        <p>3.3 หากสินค้ามีข้อบกพร่องหรือไม่สอดคล้องกับการรับประกันที่ให้ไว้ข้างต้น ผู้ส่งสินค้าต้องทดแทนสินค้าที่บกพร่องด้วยสินค้าที่สอดคล้องกับการรับประกันที่กำหนดไว้อย่างเร็วที่สุด โดยไม่มีการเรียกร้องค่าใช้จ่ายเพิ่มเติมใด ๆ กับลูกค้า</p>
                        <p>3.4 หากสินค้าไม่เป็นไปตามหลักเกณฑ์ที่ระบุไว้ในใบสั่งซื้อ ลูกค้ามีสิทธิ์ในการปฏิเสธในการรับสินค้าโดยไม่มีการเรียกเก็บค่าใช้จ่าย หรือกรณีที่ลูกค้าส่งคืนสินค้า ค่าส่งคืนสินค้านั้น บริษัทฯ จะหักจากค่าสินค้าที่ต้องจ่ายให้กับผู้ส่งสินค้าในรอบการจ่ายเงินถัดไป</p>
                        <p>3.5 หากผู้ส่งสินค้า ส่งสินค้าล่าช้ากว่าที่ตกลงไว้ และลูกค้ายกเลิกคำสั่งซื้อเนื่องจากการส่งสินค้าล่าช้านี้ ผู้ส่งสินค้าจะต้องจ่ายค่าชดเชยความเสียหายให้กับบริษัทฯ เป็นจำนวน 3 เท่าของราคาสินค้า เพื่อนำไปชดเชยให้กับลูกค้าของบริษัทฯ โดยบริษัทฯ จะหักค่าปรับจากค่าสินค้าที่ต้องจ่ายให้กับผู้ส่งสินค้าในรอบการจ่ายเงินถัดไป</p>
                    </div><br>

                    <strong>4) ราคาสินค้า</strong>
                    <p class="ml-4 space-y-2">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;บริษัทฯ ตกลงจำหน่ายสินค้าแทนผู้ฝากขายบนเว็บไซต์ และ/หรือทุกช่องทางของบริษัทฯ โดยในการสั่งสินค้าเข้ามาจำหน่ายแทนเจ้าของสินค้าในแต่ละครั้ง เจ้าของสินค้ายินยอมให้บริษัทฯเป็นผู้กำหนดราคาจำหน่ายสินค้าในแต่ละประเภทให้เป็นไปตามที่คู่สัญญาทั้งสองฝ่ายตกลงร่วมกัน โดยสินค้าที่ผู้ฝากขายนำมาฝากขายนั้นต้องมีราคาต่ำกว่าหรือถูกกว่าท้องตลาดหรือต่ำกว่าราคาส่ง ทั้งนี้ให้ถือดุลยพินิจของบริษัทฯ เป็นที่สุดในการพิจารณา</p>
                    <br>

                    <strong>5) การจัดส่งสินค้า</strong>
                    <div class="ml-4 space-y-2">
                        <p>5.1 เมื่อมีคำสั่งซื้อจากลูกค้าเข้ามาในระบบของทางบริษัทฯ ระบบจะแจ้งเมล์แบบอัตโนมัติไปที่ผู้ฝากขายตามเมล์ที่ให้ไว้กับบริษัทฯ หรือสามารถเช็คยอดคำสั่งซื้อผ่านช่องทางระบบของตนเองได้ ผู้ฝากขายมีหน้าที่จัดส่งสินค้าตามรายการที่แจ้งในเมล์ให้ถึงลูกค้าภายใน 2 วันหลังจากได้รับคำสั่งซื้อจากช่องทางติดต่อของบริษัทฯ (ไม่รวมระยะเวลาจัดส่งสินค้า) </p>
                        <p>5.2 การส่งมอบสินค้าให้แก่ลูกค้าจะถือว่าสมบูรณ์ เมื่อลูกค้าได้รับสินค้าจากเจ้าของสินค้าและดำเนินการตรวจสอบถึงความชำรุด บกพร่อง ความถูกต้องเบื้องต้น ตามลักษณะหีบห่อบรรจุภัณฑ์ ตามที่ตกลงกันครบถ้วนในตัวสินค้าที่จำหน่าย พร้อมเซ็นรับสินค้าในใบส่งของเรียบร้อยแล้ว</p>
                        <p>5.3 บริษัทฯ และลูกค้าของบริษัทฯ มีสิทธิปฏิเสธความรับผิดชอบ หากมีการจัดส่งสินค้าไปยังสถานที่อื่นนอกเหนือจากที่ระบุไว้ในใบสั่งซื้อ</p>
                    </div><br>

                    <strong>6) การเปลี่ยนคืนสินค้า</strong>
                    <p class="ml-4 mb-2">ผู้ฝากขายยินยอมให้รับคืนสินค้าที่นำมาวางจำหน่ายบนเว็บไซต์ หรือทุกช่องทางของบริษัทฯ ได้ในกรณีดังต่อไปนี้</p>
                    <div class="ml-4 space-y-2">
                        <p>6.1 หากลูกค้าตรวจสอบสินค้าแล้ว ปรากฏว่าไม่ถูกต้องครบถ้วนตามใบส่งของ พบความชำรุดบกพร่องในตัวสินค้า หรือสินค้าหมดอายุ บริษัทฯ จะแจ้งให้ผู้ฝากขายทราบทันที และผู้ฝากขายจะต้องทำการเปลี่ยนสินค้าดังกล่าวภายใน 3 วันนับจากวันที่บริษัทฯ แจ้งให้ผู้ฝากขายทราบ ด้วยค่าใช้จ่ายของผู้ฝากขายเองทั้งสิ้น</p>
                        <p>6.2 สินค้าที่บริษัทฯ ได้รับมาวางจำหน่ายไม่สามารถจำหน่ายได้และไม่เป็นไปตามความต้องการของลูกค้า ภายในรอบการใด ๆ ที่บริษัทฯ กำหนด</p>
                        <p>6.3 สินค้าที่ละเมิดหรืออาจละเมิดทรัพย์สินทางปัญญาอันรวมถึงแต่ไม่จำกัดเพียง ลิขสิทธิ์ สิทธิบัตร เครื่องหมายทางการค้าหรือผิดกฎหมาย โดยให้ถือความเห็นของบริษัทฯ เป็นที่สุด</p>
                        <p>6.4 สินค้าที่ลูกค้านำมาคืนหรือเปลี่ยน เนื่องจากชำรุดบกพร่องหรือไม่ได้มาตรฐานอันเนื่องมาจากกระบวนการผลิต การขนส่งสินค้า</p>
                        <p>6.5 สินค้าที่หมดอายุ เปลี่ยนสภาพหรือเสื่อมสภาพ ก่อนระยะเวลาอันเป็นปกติสำหรับสินค้าประเภทนั้น ๆ ทั้งนี้การคืนสินค้าดังกล่าวให้ถือเป็นดุลยพินิจเด็ดขาดและเป็นที่ยุติของบริษัทฯ</p>
                        <p>6.6 ในการคืนสินค้าไปยังเจ้าของสินค้าดังกล่าว ตามข้อ 6.1 – 6.5 ผู้ฝากขายเป็นผู้รับผิดชอบค่าใช้จ่ายทั้งหมดแต่เพียงผู้เดียว</p>
                    </div><br>

                    <strong>7) การรับประกันและการเรียกค่าเสียหาย</strong>
                    <div class="ml-4 space-y-2">
                        <p>7.1 ผู้ฝากขายตกลงให้บริษัทฯ และลูกค้า สามารถคืนสินค้าได้ในทุกกรณี ถ้าสินค้าไม่ถูกต้องครบถ้วนตามใบส่งของ พบความชำรุดบกพร่องในตัวสินค้า หรือสินค้าหมดอายุ ด้วยค่าใช้จ่ายของผู้ฝากขายแต่เพียงผู้เดียว</p>
                        <p>7.2 หากลูกค้าที่ซื้อสินค้าผ่านทางเว็บไซต์ของบริษัทฯ ซึ่งได้ใช้หรือบริโภคสินค้า ส่งผลให้เกิดอาการแพ้ ระคายเคือง หรือไม่ได้รับความปลอดภัยจากสินค้ารวมถึงความเสียหายอื่นๆ ที่ลูกค้าได้รับ ผู้ฝากขายจะต้องเป็นผู้รับผิดชอบชดเชยความเสียหายทั้งหมดแต่เพียงผู้เดียว</p>
                        <p>7.3 หากผู้ฝากขายใส่ข้อมูลสินค้าผิด เช่น ราคา คุณสมบัติ สี และอื่นๆ ทางผู้ฝากขายจะต้องส่งสินค้าทดแทนออกไปให้ลูกค้าโดยไม่มีข้อแม้ และไม่มีค่าใช้จ่ายเพิ่มเติม หากตรวจสอบแล้วพบว่าผู้ฝากขายใส่ข้อมูลผิดจริง</p>
                        <p>7.4 ในกรณีที่เป็นสินค้านำเข้าจากต่างประเทศทุกชนิด จะต้องมีการรับประกันการเปลี่ยนสินค้าใหม่ให้กับลูกค้า หรือรับคืนสินค้าภายใน 14 วัน โดยนับตั้งแต่วันที่ลูกค้าได้รับสินค้าแล้ว ตามเงื่อนไขดังนี้</p>
                        <div class="ml-4 space-y-2">
                            <p>&nbsp;- สินค้าชำรุดจากการผลิต</p>
                            <p>&nbsp;- สินค้าที่ได้รับจริง ไม่ตรงกับข้อมูลสินค้าที่ปรากฏในเว็บไซต์ของบริษัทฯ หรือให้ข้อมูลเกินความเป็นจริง</p>
                            <p>&nbsp;- คำอธิบายสินค้าหรือรูปภาพสินค้าที่ปรากฏ กำกวม ไม่ชัดเจน ทำให้ลูกค้าเข้าใจผิด</p>
                        </div>
                        <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;แต่หากเกิน 14 วันโดยนับตั้งแต่วันที่ลูกค้าได้รับสินค้า ผู้ฝากขายจะต้องรับผิดชอบ รับประกันของตัวสินค้าตามระยะเวลาที่ระบุไว้ในรายละเอียดสินค้า โดยบริษัทฯ จะให้ลูกค้าติดต่อกับผู้ฝากขายโดยตรง และผู้ฝากขายจะต้องดำเนินการแก้ไขปัญหาตามที่ได้สัญญากับลูกค้า </p>
                    </div><br>

                    <strong>8) ข้อตกลงและเงื่อนไข การส่งมอบและการจำหน่ายสินค้า ดังต่อไปนี้</strong>
                    <div class="ml-4 space-y-2">
                        <p>8.1 บริษัทฯ ตกลงจำหน่ายสินค้าแทนเจ้าของสินค้าบนเว็บไซต์ และ/หรือทุกช่องทางของบริษัทฯ โดยในการสั่งสินค้าเข้ามาจำหน่ายแทนเจ้าของสินค้าในแต่ละครั้ง ผู้ฝากขายยินยอมให้บริษัทฯ เป็นผู้กำหนดราคาจำหน่ายสินค้าในแต่ละประเภทให้เป็นไปตามที่คู่สัญญาทั้งสองฝ่ายตกลงร่วมกัน</p>
                        <p>8.2 ผู้ฝากขาย มีหน้าที่ให้รายละเอียดสินค้า รูปภาพ และคุณสมบัติของสินค้า และใบอนุญาตที่กฎหมายกำหนด และต้องผ่านการรับรองผลิตภัณฑ์จากสำนักงานคณะกรรมการอาหารและยา (Food and Drug Administration) กระทรวงสาธารณะสุข ตลอดจนการนำเสนอสินค้าต้องเป็นไปตามรูปแบบที่บริษัทฯ กำหนดเท่านั้น ทั้งนี้ด้วยค่าใช้จ่ายของผู้ฝากขายเองทั้งสิ้น และผู้ฝากขายต้องให้รายละเอียดข้อมูลกับบุคลากรของบริษัทฯ เพื่อให้มีความรู้ ความเข้าใจในตัวสินค้าที่จำหน่ายของเจ้าของสินค้า ด้วยค่าใช้จ่ายของเจ้าของสินค้าเองทั้งสิ้น</p>
                        <p>8.3 ห้ามผู้ฝากขาย ส่งสื่อโฆษณาใดๆ ที่ไม่เกี่ยวข้องกับบริษัทฯ ไปให้ลูกค้า หรือทำการติดต่อ หรือชักชวนลูกค้าเพื่อทำการอย่างอื่นที่ไม่เกี่ยวข้องกับสินค้า และไม่เกี่ยวข้องกับบริษัทฯ</p>
                        <p>8.4 ผู้ฝากขาย มีหน้าที่ช่วยเหลือและให้การสนับสนุนเกี่ยวกับการโฆษณาการประชาสัมพันธ์และการส่งเสริมการขายให้แก่บริษัทฯ ตามความเหมาะสม และต้องช่วยเหลือทางเทคนิคในการดำเนินธุรกิจ การจัดให้มีการโฆษณา และการประชาสัมพันธ์ เช่น การจัดหาแผ่นโฆษณา แผ่นพับ ใบปลิว และบัญชีรายการสินค้า อื่น ๆ</p>
                        <p>8.5 ผู้ฝากขาย จะต้องดำเนินการจัดส่งสินค้าไปยังลูกค้าตามคำสั่งของบริษัทฯ โดยจัดส่งให้ลูกค้าภายใน 2 วันหลังจากได้รับคำสั่งซื้อจากช่องทางติดต่อของบริษัทฯ (ไม่รวมระยะเวลาจัดส่งสินค้า) และสินค้าที่จัดส่งต้องมีสภาพสมบูรณ์ และต้องเป็นสินค้าที่ยังไม่หมดอายุ เปลี่ยนสภาพ เสื่อมสภาพ ตามใบสั่งสินค้า พร้อมกับส่งใบส่งของและสำเนาใบกำกับภาษี ด้วยค่าใช้จ่ายและความรับผิดต่อลูกค้าให้ตกเป็นพับแก่เจ้าของสินค้าทั้งสิ้น</p>
                        <p>8.6 การส่งมอบสินค้าให้แก่ลูกค้าจะถือว่าสมบูรณ์ เมื่อลูกค้าได้รับสินค้าจากผู้ฝากขายและดำเนินการตรวจสอบถึงความชำรุด บกพร่อง ความถูกต้องเบื้องต้น ตามลักษณะหีบห่อบรรจุภัณฑ์ ตามที่ตกลงกันครบถ้วนในตัวสินค้าที่จำหน่าย พร้อมเซ็นรับสินค้าในใบส่งของเรียบร้อยแล้ว (ดังข้อ 5.2)</p>
                        <p>8.7 หากลูกค้าตรวจสอบสินค้าแล้ว ปรากฏว่าไม่ถูกต้องครบถ้วนตามใบส่งของหรือพบความชำรุดบกพร่องในตัวสินค้า บริษัทฯ จะแจ้งให้เจ้าของสินค้าทราบทันที และผู้ฝากขายจะต้องทำการเปลี่ยนสินค้าดังกล่าวภายใน 3 วันนับจากวันที่บริษัทฯ แจ้งให้ผู้ฝากขายทราบ ด้วยค่าใช้จ่ายของผู้ฝากขายเองทั้งสิ้น (ดังข้อ 6.1)</p>
                    </div><br>

                    <strong>9) การส่งมอบเงินค่าสินค้า และส่วนแบ่งรายได้</strong>
                    <div class="ml-4 space-y-2">
                        <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;ผู้ฝากขายตกลงจ่ายส่วนแบ่งรายได้ในการดำเนินการจำหน่ายสินค้าให้กับบริษัทฯ ในอัตราตามตกลงของราคาจำหน่าย รายละเอียดตามเอกสารแนบท้ายสัญญาฉบับนี้</p>
                        <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;บริษัทฯ และผู้ฝากขายจะทำการสรุปยอดขายรวมกันทุก ๆ วัน โดยบริษัทฯ จะทำการโอนเงินต้นทุนของสินค้าให้แก่ผู้ฝากขายต่อเมื่อสินค้าจัดส่งถึงลูกค้า และสินค้าที่ลูกค้าได้รับนั้นไม่เกิดความเสียหาย และไม่มีการร้องเรียนเนื่องจากคุณภาพของสินค้าภายใน 7 วัน</p>
                    </div><br>

                    <strong>10) การรับประกันสินค้า</strong>
                    <div class="ml-4 space-y-2">
                        <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;ผู้ส่งสินค้าจะต้องรับประกันสินค้าตามระบุในเว็บไซต์หรือตัวสินค้า และเป็นผู้รับผิดชอบหากสินค้าต่ำกว่ามาตรฐานหรือเสียหายระหว่างการจัดส่ง</p>
                        <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;หากสามารถพิสูจน์ได้ว่าสินค้าที่ส่งเป็นสินค้าที่ไม่ได้ลิขสิทธิ์ถูกต้อง ไม่ได้จดแจ้งหน่วยงานภาครัฐอย่างถูกกฎหมาย หรือเป็นสินค้าปลอมแปลง สินค้าลอกเลียนแบบ ทางบริษัทฯ จะทำการปรับเป็นมูลค่า 20 เท่าของราคาปลีกของสินค้า และจะดำเนินคดีตามกฎหมาย</p>
                    </div><br>

                    <strong>11) การปฏิเสธความรับผิด</strong>
                    <div class="ml-4 space-y-2">
                        <p>11.1 ทางบริษัทฯ ไม่มีความเกี่ยวข้องใด ๆ สำหรับช่องทางการจำหน่ายของผู้ฝากขาย รวมถึงการนำเสนอหรือการให้ข้อมูลต่อสาธารณชนเพื่อจำหน่ายหรือประชาสัมพันธ์ อันเป็นการละเมิดต่อข้อบังคับของบริษัทฯ</p>
                        <p>11.2 บริษัทฯ เป็นเพียงตัวแทนการชำระเงิน และบริษัทฯ ไม่ทราบถึงข้อตกลงที่ทำขึ้นหรือสิทธิข้อผูกพันใด ๆ ระหว่างผู้บริโภคและผู้เรียกเก็บเงิน บริษัทฯ จึงไม่ต้องรับผิดชอบสำหรับความเสียหายที่เกิดขึ้นจากการละเมิดข้อตกลงระหว่างผู้บริโภคกับผู้เรียกเก็บเงิน ผู้ฝากขายรับทราบและตกลงว่าเป็นความรับผิดชอบของผู้ฝากขายแต่เพียงผู้เดียว ในการทำให้แน่ใจว่าคำสั่งการชำระของผู้บริโภคถูกต้อง ก่อนที่จะมีคำสั่งให้ทางบริษัทฯ ทำการจ่ายเงิน บริษัทฯ จะไม่รับผิดชอบในความรับผิดหรือค่าใช้จ่ายจากการชำระเกินกำหนดที่เกิดขึ้น</p>
                        <p>11.3 หากความผิดพลาด ล่าช้า ไม่ว่าจะเกิดขึ้นจากระบบคอมพิวเตอร์ ระบบอินเตอร์เน็ต อุปกรณ์อิเล็กทรอนิกส์ต่าง ๆ ระบบแพลตฟอร์มของทางบริษัทฯ ระบบขนส่งหรือระบบอื่นใดที่เกี่ยวข้องกับการให้บริการ ไม่ว่าจะเกิดเหตุใด ๆ ผู้ฝากขายตกลงจะไม่ยกเอาเหตุขัดข้องดังกล่าวมาเป็นข้อเรียกร้องค่าเสียหายใด ๆ จากบริษัทฯ</p>
                    </div><br>

                    <strong>12) ความลับทางการค้า</strong>
                    <p class="ml-4">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;ในการเข้าทำสัญญาฉบับนี้ คู่สัญญาแต่ละฝ่ายอาจได้ล่วงรู้หรือได้รับข้อมูลของคู่สัญญาอีกฝ่ายหนึ่ง ไม่ว่าจากคู่สัญญาอีกฝ่ายหนึ่งนั้นเองหรือจากบุคคลอื่นใด คู่สัญญาแต่ละฝ่ายต่างตกลงจะเก็บรักษาข้อมูลของคู่สัญญาอีกฝ่ายไว้เป็นความลับ ไม่ว่าจะเป็นข้อมูลส่วนบุคคลหรือข้อมูลทางการค้า และไม่ว่าจะมีมูลค่าหรือไม่ก็ตาม และจะไม่เปิดเผย ตีพิมพ์ ประกาศ รับรอง หรือเผยแพร่ต่อบุคคลที่สาม ไม่ว่า ณ เวลาใด และไม่ว่าสัญญาฉบับนี้จะสิ้นสุดลงแล้วหรือไม่ก็ตาม</p>
                    <br>
                    
                    <strong>13) การโอนสิทธิ</strong>
                    <p class="ml-4">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;เว้นแต่จะได้กำหนดไว้เป็นอย่างอื่นในสัญญานี้ คู่สัญญาแต่ละฝ่ายไม่มีสิทธิ์โอนสิทธิ หน้าที่ และความรับผิดชอบตามสัญญาฉบับนี้ให้แก่บุคคลใดโดยมิได้รับความยินยอมเป็นลายลักษณ์อักษรจากคู่สัญญาอีกฝ่ายเป็นการล่วงหน้า ไม่ว่ากรณีใด ๆ ผู้ฝากขายไม่มีสิทธิ์โอนสิทธิ และหน้าที่ตามสัญญาฉบับนี้ไม่ว่าทั้งหมดหรือบางส่วนให้แก่บุคคลที่สาม</p>
                    <br>

                    <strong>14) โมฆะกรรมแยกส่วน</strong>
                    <p class="ml-4">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;หากมีข้อความหรือข้อตกลงใดในสัญญาฉบับนี้ตกเป็นโมฆะ ไม่สมบูรณ์หรือไม่มีผลบังคับใช้ ไม่ว่าด้วยเหตุใด ๆ ก็ตาม คู่สัญญาตกลงให้ข้อความและข้อตกลงอื่น ๆ ในสัญญาฉบับนี้ยังคงมีผลสมบูรณ์ ผูกพันธ์คู่สัญญาเสมือนหนึ่งว่าไม่มีส่วนที่เป็นโมฆะ ไม่สมบูรณ์หรือส่วนที่ไม่มีผลบังคับใช้อยู่ในสัญญาฉบับนี้</p>
                    <br>

                    <strong>15) การแก้ไข เปลี่ยนแปลง ปรับปรุง ระบบทุกรูปแบบ</strong>
                    <div class="ml-4 space-y-2">
                        <p>15.1 บริษัทฯ มีสิทธิ์อนุมัติ เปลี่ยนแปลง แก้ไข ยกเลิก ระบบบริหารจัดการ/ โปรแกรมออนไลน์ ระบบบัญชีผู้บริหารงานจัดการออนไลน์ และระบบบริหารจัดการศูนย์ทุกรูปแบบ โดยไม่จำเป็นต้องแจ้งให้ผู้ฝากขายทราบล่วงหน้า และการที่ผู้ฝากขายได้ใช้งานระบบได้ทำการแก้ไขเรียบร้อยแล้วนั้น ถือเป็นการยอมรับการแก้ไขในครั้งนั้นแล้ว</p>
                        <p>15.2 บริษัทฯ ขอสงวนสิทธิ์ในการปรับปรุงหรือยกเลิกบริการหรือส่วนใดส่วนหนึ่งของบริการ ไม่ว่าจะชั่วคราวหรือตลอดไปได้ตลอดเวลา โดยบริษัทฯ จะแจ้งล่วงหน้าให้ทราบหรือไม่ก็ได้ แต่ทั้งนี้การยกเลิกหรือการระงับบริการหรือส่วนใดส่วนหนึ่งของบริษัทฯ ย่อมไม่กระทบถึงหนี้ใด ๆ ที่ผู้ฝากขายยังคงค้างชำระอยู่กับบริษัทฯ รวมทั้งไม่เป็นการลบล้างสิทธิหรือความรับผิดใด ๆ ที่บริษัทฯ และผู้ฝากขายมีอยู่หรือได้เกิดขึ้นก่อนวันที่มีผลของการยกเลิกหรือการระงับบริการหรือส่วนหนึ่งส่วนใดของบริการดังกล่าว</p>
                    </div><br>

                    <strong>16) การยกเลิกสัญญา</strong>
                    <div class="ml-4 space-y-2">
                        <p>16.1 หากคู่สัญญาฝ่ายหนึ่งฝ่ายใดประสงค์จะบอกเลิกสัญญา จะต้องทำเป็นหนังสือแจ้งความประสงค์ล่วงหน้าแก่คู่สัญญาอีกฝ่ายหนึ่งไม่น้อยกว่า 30 วัน โดยฝ่ายที่ถูกกระทำละเมิดมีสิทธิเรียกร้องค่าใช้จ่ายหรือค่าเสียหายได้</p>
                        <p>16.2 สัญญาฉบับนี้ถูกยกเลิกหรือผู้ฝากขายกระทำความผิดตามสัญญาข้อหนึ่งข้อใด บริษัทฯ มีสิทธิ์บอกเลิกสัญญาได้ทันที และผู้ฝากขายตกลงจะมารับสินค้าคืนภายใน 15 วัน โดยบริษัทฯ จะไม่รับผิดชอบความเสียหายที่เกิดขึ้นกับสินค้าทุกกรณี และบริษัทฯ สิทธิมีเรียกร้องค่าใช้จ่ายหรือค่าเสียหายจากผู้ฝากขายได้</p>
                    </div><br>

                    <strong>17) การแก้ไขเพิ่มเติม</strong>
                    <p class="ml-4">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;บริษัทฯ ขอสงวนสิทธิ์ในการแก้ไขเพิ่มเติมข้อกำหนด และเงื่อนไขเหล่านี้ ณ เวลาใดก็ได้ ข้อแก้ไขเพิ่มเติมต่อเงื่อนไขเหล่านี้จะประกาศไว้ในแพลตฟอร์มของบริษัทฯ อย่างไรก็ตามการใช้บริการกับบริษัทฯ ต่อไปจะถือว่าเป็นการยอมรับเงื่อนไขใหม่ เมื่อผู้ฝากขายใช้บริการกับแพลตฟอร์มการให้บริการของบริษัทฯ บริษัทฯ ตกลงว่าผู้ฝากขายกระทำการดังกล่าวภายใต้เงื่อนไขเหล่านี้ที่เป็นปัจจุบันขณะนั้น ณ วันที่ผู้ฝากขายใช้บริการ และผู้ฝากขายมีหน้าที่ที่จะต้องทบทวนเงื่อนไขล่าสุดทุกครั้งที่ใช้บริการในระบบของบริษัทฯ</p>
                    <br>

                    <strong>18) กฎหมายที่บังคับใช้</strong>
                    <div class="ml-4 space-y-2">
                        <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;ทั้งนี้ ในกรณีที่ไม่สามารถหาข้อยุติในข้อพิพาทดังกล่าวระหว่างคู่สัญญาทั้งสองฝ่ายได้ ข้อพิพาท ข้อโต้เถียง ข้อขัดแย้งใด ๆ อันเนื่องมาจากสัญญาฉบับนี้ หากคู่สัญญาไม่สามารถตกลงกันได้ คู่สัญญาตกลงจะนำข้อพิพาทดังกล่าวขึ้นฟ้องต่อศาลในประเทศไทย</p>
                        <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;สัญญาฉบับนี้ทำขึ้นสองฉบับมีข้อความถูกต้องตรงกัน คู่สัญญาแต่ละฝ่ายได้อ่านโดยตลอดแล้วยืนยันว่าถูกต้องตามเจตนา จึงได้ลงลายมือชื่อไว้เป็นสำคัญ</p>
                        <p><span class="font-semibold text-error">หมายเหตุ :</span> พระราชบัญญัติว่าด้วยธุรกรรมทางอิเล็กทรอนิกส์ พ.ศ. ๒๕๔๔ ที่แก้ไขเพิ่มเติม (ฉบับที่ 3) พ.ศ.2562 ถือว่า การเข้าสู่ระบบโดยใช้ชื่อผู้ใช้ ( username ) และรหัสผ่าน ( password ) เข้าสู่ระบบ และมีการยอมรับเงื่อนไข และข้อตกลงในระบบ ถือว่าสัญญาฉบับนี้สมบูรณ์</p>
                    </div>
                </div>
            </div>

            <!-- Modal Footer -->
            <div
                class="flex flex-col justify-center p-4 md:p-5 border-t border-gray-200 rounded-b ">
                <span class="font-sarabun">ยินยอมเมื่อ xx/xx/xxxx xx:xx:xx </span>
                <div class="flex justify-center items-center w-full">
                    <button @click="closeModal" type="button"
                        class="text-white font-sarabun bg-red-500 hover:bg-red-700 font-medium rounded-lg text-sm px-5 py-2.5 text-center">
                        ปิด
                    </button>
                </div>
            </div>
        </div>
    </div>
    <!-- End Main modals -->
</template>

<script>
export default {
    props: {
    isVisible: Boolean,
    contractDetails: String
  },
  methods: {
    closeModal() {
      this.$emit('close'); // Emit close event to parent
    }
  }
}
</script>

<style></style>